real-silentsin/CH32V003A4M6_MegaPack_Library/SSS_Common_Lib_V1/sss_classes.h
/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_classes.h
 * Author             : vantr
 * Version            : V1.1.0
 * Date               : 2026/07/30
 * Target             : CH32V003
 * Description        : Общая библиотека
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef SSS_CLASSES
// -----------------------------------------------------------------------------
#define SSS_CLASSES
// -----------------------------------------------------------------------------
#include "ch32v00x.h"
// -----------------------------------------------------------------------------
#ifndef _MSC_VER
    // Для всех компиляторов, кроме Microsoft (GCC/Clang), 
    // заставляем игнорировать неизвестные прагмы
    #pragma GCC diagnostic ignored "-Wunknown-pragmas"
    #pragma GCC diagnostic ignored "-Wsequence-point"
#endif
// -----------------------------------------------------------------------------
// Флаг использования LCD в проекте. Если LCD не используется, закомментируйте этот флаг!
//#define USE_LCD
// -----------------------------------------------------------------------------
#define PORT_OUTPUT     0
#define PORT_INPUT      1
// -----------------------------------------------------------------------------
#define TRUE            1
#define FALSE           0
// -----------------------------------------------------------------------------
#define DEBUG_ENABLE 0  // Поменяйте на 1, если снова понадобится отладка
// Отключаемый вывод! Используйте в тексте не "LOG_PRINT", а "LOG_PRINT"
#if DEBUG_ENABLE
#define LOG_PRINT(...) printf (__VA_ARGS__)  // или ваша функция
#else
// if(0) полностью стирается оптимизатором, но переменные считаются "использованными"
#define LOG_PRINT(...)            \
    do {                          \
        if (0) {                  \
            printf (__VA_ARGS__); \
        }                         \
    } while (0)
#endif
// -----------------------------------------------------------------------------
// Символы для перевода в шестнадцатиричный код
#define HEX_STR         "0123456789ABCDEF"
// -----------------------------------------------------------------------------
// Структура для передачи параметров - десятичных цифр
typedef struct {
    uint8_t value1;
    uint8_t value2;
    uint8_t sign;
    uint8_t extend;
} Params;
// -----------------------------------------------------------------------------
// Структура для передачи параметров 16-битная
typedef struct {
    uint16_t param1;
    uint16_t param2;
    uint16_t param3;
    uint16_t param4;
} Params16;
// -----------------------------------------------------------------------------
// Структура для конвертации одно и двухбайтовых целых значений
typedef union {
  uint16_t ivalue;
  uint8_t cvalue[2];
} Int16x;

// -----------------------------------------------------------------------------
// Структура для конвертации одно и четырехбайтовых целых значений
typedef union {
  uint32_t ivalue;
  uint8_t cvalue[4];
} Int32x;
// -----------------------------------------------------------------------------
// Структура битовая для флагов
typedef union {
    unsigned char byte;

    struct {
        unsigned b0 : 1, b1 : 1, b2 : 1, b3 : 1, b4 : 1, b5 : 1, b6 : 1, b7 : 1;
    };
} byte_t;
// ----------------------------------------------------------------------------
// Описания портов
// ----------------------------------------------------------------------------
/*
 * static const PinDefine_t MISC_PORT = {  // PC16
 *   .rcc =                              RCC_APB2Periph_GPIOC,
 *   .port =                             GPIOC,
 *   .pin =                              GPIO_Pin_16
 * };
 */
// ----------------------------------------------------------------------------
// Сущность для одного пина
typedef struct {
    GPIO_TypeDef *port;
    uint32_t pin;
    uint32_t rcc;
} PinDefine_t;
// ----------------------------------------------------------------------------
// Расширенная структура для пинов с поддержкой прерываний
// ВНИМАНИЕ! Для работы прерывания обязательно включите тактирование модуля AFIO!
typedef struct {
    GPIO_TypeDef *port;
    uint32_t pin;
    uint32_t rcc;
    uint8_t exti_port_src;  // Для EXTI: GPIO_PortSourceGPIOx
    uint8_t exti_pin_src;   // Для EXTI: GPIO_PinSourcex
    uint32_t exti_line;     // Для EXTI: EXTI_Linex
} ExtPinDefine_t;
// -----------------------------------------------------------------------------
// Перевод целого числа [0..99] в символы
Params _int_to_str(uint8_t value);
// -----------------------------------------------------------------------------
//Перевод целого числа в символьное шестнадцатиричное
Params _int_to_hex (uint8_t value);
// -----------------------------------------------------------------------------
// Разбор чисел до 9999 на отдельные значения - { 9, 9, 9, 9 }
Params decompose_uint16 (uint16_t value);
// -----------------------------------------------------------------------------
/* Макросы для битовых операций */
// -----------------------------------------------------------------------------
// Очистка или установка бита (по ИНДЕКСУ бита)
#define sbi(b, idx) ((b) |= (1UL << (idx)))
#define cbi(b, idx) ((b) &= ~(1UL << (idx)))
// -----------------------------------------------------------------------------
/* Для работы по ИНДЕКСУ бита */
#define is_set_idx(b, idx) (((b) & (1UL << (idx))) != 0)
#define is_clear_idx(b, idx) (((b) & (1UL << (idx))) == 0)
// -----------------------------------------------------------------------------
/* Для работы по МАСКЕ ( (1<<4), 0x10, и т.д. ) */
#define is_set_mask(val, mask) (((val) & (mask)) != 0)
#define is_clear_mask(val, mask) (((val) & (mask)) == 0)
// -----------------------------------------------------------------------------
#ifndef MAX
#define MAX(a, b) (((a) > (b)) ? (a) : (b))
#endif
#ifndef MIN
#define MIN(a, b) (((a) < (b)) ? (a) : (b))
#endif
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------
